---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.CloudPoint.op_Implicit(Autodesk.Revit.DB.PointClouds.CloudPoint)~Autodesk.Revit.DB.XYZ
source: html/9fe0aaec-d26d-8887-c89b-b35467764093.htm
---
# Autodesk.Revit.DB.PointClouds.CloudPoint.op_Implicit Method

Creates an XYZ object from this point cloud.

## Syntax (C#)
```csharp
public static implicit operator XYZ (
	CloudPoint cp
)
```

## Parameters
- **cp** (`Autodesk.Revit.DB.PointClouds.CloudPoint`)